; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-7packages-1005seed

(define (problem transport-two-cities-sequential-4nodes-1000size-4degree-100mindistance-2trucks-7packages-1005seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  package-7 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 923,408 -> 494,808
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 59)
  ; 494,808 -> 923,408
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 59)
  ; 550,420 -> 494,808
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 40)
  ; 494,808 -> 550,420
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 40)
  ; 550,420 -> 923,408
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 38)
  ; 923,408 -> 550,420
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 38)
  ; 897,965 -> 494,808
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 44)
  ; 494,808 -> 897,965
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 44)
  ; 897,965 -> 923,408
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 56)
  ; 923,408 -> 897,965
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 56)
  ; 897,965 -> 550,420
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 65)
  ; 550,420 -> 897,965
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 65)
  ; 2307,366 -> 2586,653
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 40)
  ; 2586,653 -> 2307,366
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 40)
  ; 2183,500 -> 2586,653
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 44)
  ; 2586,653 -> 2183,500
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 44)
  ; 2183,500 -> 2307,366
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 19)
  ; 2307,366 -> 2183,500
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 19)
  ; 2125,586 -> 2586,653
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 47)
  ; 2586,653 -> 2125,586
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 47)
  ; 2125,586 -> 2307,366
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 29)
  ; 2307,366 -> 2125,586
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 29)
  ; 2125,586 -> 2183,500
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 11)
  ; 2183,500 -> 2125,586
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 11)
  ; 923,408 <-> 2125,586
  (road city-1-loc-2 city-2-loc-4)
  (= (road-length city-1-loc-2 city-2-loc-4) 122)
  (road city-2-loc-4 city-1-loc-2)
  (= (road-length city-2-loc-4 city-1-loc-2) 122)
  (at package-1 city-1-loc-3)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-2)
  (at package-4 city-1-loc-1)
  (at package-5 city-1-loc-1)
  (at package-6 city-1-loc-3)
  (at package-7 city-1-loc-1)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-1)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-1)
  (at package-5 city-2-loc-4)
  (at package-6 city-2-loc-2)
  (at package-7 city-2-loc-4)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-1 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-4)
   goals met: 0 of 7
2. (drive truck-2 city-2-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 7
3. (drive truck-2 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 7
4. (pick-up truck-2 city-1-loc-3 package-6 capacity-2 capacity-3)
   deleted: (at package-6 city-1-loc-3) (capacity truck-2 capacity-3)
   added: (in package-6 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 7
5. (pick-up truck-2 city-1-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-3) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 7
6. (pick-up truck-2 city-1-loc-3 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-3) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 7
7. (drive truck-1 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 7
8. (drive truck-1 city-2-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 7
9. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 7
10. (pick-up truck-1 city-1-loc-1 package-7 capacity-2 capacity-3)
   deleted: (at package-7 city-1-loc-1) (capacity truck-1 capacity-3)
   added: (in package-7 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 7
11. (pick-up truck-1 city-1-loc-1 package-5 capacity-1 capacity-2)
   deleted: (at package-5 city-1-loc-1) (capacity truck-1 capacity-2)
   added: (in package-5 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 7
12. (pick-up truck-1 city-1-loc-1 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-4 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 7
13. (drive truck-2 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 7
14. (drive truck-2 city-1-loc-2 city-2-loc-4)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-2-loc-4)
   goals met: 0 of 7
15. (drive truck-2 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-4)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 7
16. (drop truck-2 city-2-loc-2 package-6 capacity-0 capacity-1)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-0)
   added: (at package-6 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 1 of 7
17. (drop truck-2 city-2-loc-2 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-2-loc-2) (capacity truck-2 capacity-2)
   goals met: 2 of 7
18. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 2 of 7
19. (drop truck-2 city-2-loc-1 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-2)
   added: (at package-2 city-2-loc-1) (capacity truck-2 capacity-3)
   goals met: 3 of 7
20. (drive truck-1 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-2)
   goals met: 3 of 7
21. (drive truck-1 city-1-loc-2 city-2-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-4)
   goals met: 3 of 7
22. (drop truck-1 city-2-loc-4 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-0)
   added: (at package-5 city-2-loc-4) (capacity truck-1 capacity-1)
   goals met: 4 of 7
23. (drive truck-1 city-2-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 4 of 7
24. (pick-up truck-1 city-1-loc-2 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-2) (capacity truck-1 capacity-1)
   added: (in package-3 truck-1) (capacity truck-1 capacity-0)
   goals met: 4 of 7
25. (drive truck-1 city-1-loc-2 city-2-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-4)
   goals met: 4 of 7
26. (drop truck-1 city-2-loc-4 package-7 capacity-0 capacity-1)
   deleted: (in package-7 truck-1) (capacity truck-1 capacity-0)
   added: (at package-7 city-2-loc-4) (capacity truck-1 capacity-1)
   goals met: 5 of 7
27. (drive truck-1 city-2-loc-4 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-1)
   goals met: 5 of 7
28. (drop truck-1 city-2-loc-1 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-1)
   added: (at package-4 city-2-loc-1) (capacity truck-1 capacity-2)
   goals met: 6 of 7
29. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 6 of 7
30. (drop truck-1 city-2-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-2-loc-3) (capacity truck-1 capacity-3)
   goals met: 7 of 7
